pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
/* NRF24L01 module contains following pins to connect with the controller	
.
 * 
 * CE	->	Chip enable (Activates RX and TX) 
 * CSN	->	SPI chip select signal
 * SCK	->	SPI clock
 * MOSI	->	SPI data input (Master Out Slave Input)
 * MISO	->	SPI data output
 * IRQ	->	Maskable interrupt pin. Active Low
 * 
 * Required SPI operation: (Section 8 nRF24L01 Product Specification)
 * 
 * New command start with HIGH -> LOW on CSN
 * 
 * Command word: 	MSBit to LSBit
 * 
 * Data bytes:		LSByte to MSByte (MSBit first in every byte)
 * 
 * 	
 * =====================================================================
 * 	USAGE TX (Simplest) Steps:
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Define the processor type
 * 				Support: PART_LM4F120H5QR
 * [2]. Define the SPI library.
 *				Support: PDLIB_SPI
 *
 * [3]. Call NRF24L01_Init() function with correct SPI settings. (function may changed based on architecture)
 * [4]. Call NRF24L01_SendData() or NRF24L01_SendDataTo() to send data. (TX and RX data sizes should match) - Dynamic payload not supported
 *
 *
 * =====================================================================
 * 	USAGE RX (Simplest) Steps:
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Define the processor type
 * 				Support: PART_LM4F120H5QR
 * [2]. Define the SPI library.
 *				Support: PDLIB_SPI
 *
 * [3]. Call NRF24L01_Init() function with correct SPI settings. (function may changed based on architecture)
 * [4]. Set the RX packet size for required pipe using NRF24L01_SetRXPacketSize()
 * [5]. Wait for data using NRF24L01_WaitForDataRx()
 * [6]. Get the amount of received data using NRF24L01_GetRxDataAmount()
 * [7]. Get the received data using NRF24L01_GetData()
 *
 *
 * =====================================================================
 * 	Registering Interrupt (Simplest) Steps:
 * =====================================================================
 *
 *	[1]. Define 'NRF24L01_CONF_INTERRUPT_PIN' in project settings.
 *	[2]. Call NRF24L01_InterruptInit() function providing required information
 *	[3]. Create the ISR function.
 *	[4]. Register the ISR in the Interrupt Vector
 *
 * =====================================================================
 * Change Log
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Initial release.
 * [2]. Contains function support to change all the basic settings.
 * [3]. Supports LM4F120H5QR processor. (Stellaris-launchpad)
 * [4]. Three function levels defined, Simple, Average and Advanced
 * [5]. Library is compatible for both interrupt and polling
 * [6]. PDLIB_SPI library is supported by default
 *
 * =====================================================================
 * Known Issues
 * =====================================================================
 *
 * Version: 1.01
 *
 * [1]. Dynamic payload support is not added.
 * [2]. Auto ACK with payload support is not added
 *
 * =====================================================================
 * LM4F120H5QR (Stellaris)
 * =====================================================================
 * 
 * Stellaris SSI can be configured as Freescale SPI.
 * 
 * The CSN, SCK, MOSI and MISO pins are analogous to Freescale SPI.
 * 
 * Need to have a separate CE pin and IRQ pin.
 * 
 * Tested connection: 	PE1 <-> CE
 * (Using SSI3)			PE2 <-> CSN
 * 						PD0 <-> SCK
 * 						PD3 <-> MOSI
 * 						PD2 <-> MISO
 * 						PE3	<-> IRQ
 */

//#define PDLIB_DEBUG

#include <stdio.h>
#include <stdlib.h>
#include "nRF24L01.h"
#include "pdlib_nrf24l01.h"

#ifdef PDLIB_DEBUG
#include "uart_debug.h"
#endif

// SPI library
#ifdef PDLIB_SPI
#include "pdlib_spi.h"
#endif

// Processor architecture
#ifdef PART_LM4F120H5QR
#include "inc/hw_types.h"
#include "driverlib/sysctl.h"
#include "driverlib/rom.h"
#include "driverlib/interrupt.h"
#include "driverlib/gpio.h"
#endif



static void _NRF24L01_CEHigh();
static void _NRF24L01_CELow();

static void _NRF24L01_CSNHigh();
static void _NRF24L01_CSNLow();

#define TYPE_RX		0x01
#define TYPE_TX		0x02

static unsigned long g_ulCEPin;
static unsigned long g_ulCEBase;
static unsigned long g_ulCSNPin;
static unsigned long g_ulCSNBase;

static unsigned char g_ucStatus;


/* PS:
 * 
 * Function		: 	NRF24L01_Init
 * 
 * Arguments	: 	ulCEBase	:	This is the base of the CE pin
 * 					ulCEPin		:	This is the pin to be used for CE
 * 					ulCEPeriph	:	This is the peripheral bit mask
 * 					ulCSNBase	:	This is the base of the CSN pin
 * 					ulCSNPin	:	This is the pin to be used for CSN
 * 					ulCSNPeriph	:	This is the peripheral bit mask
 * 					ucSSIIndex	:	The index of the SSI module
 * 
 * Return		: 	None
 * 
 * Description	: 	The function will initialize the SSI communication 
 * 					for the module. Also the function initializes and
 * 					configures the CE pin. It will reset the registers
 * 					to their default values.
 *
 * 					We cannot use the CSN pin (ie. FSS) in the SSI module
 * 					because we need to keep it LOW throughout the data
 * 					transmission. (ie: Write and Read passes) Therefore
 * 					a different pin should be configured for this purpose
 * 
 */
 	
  
#ifdef PART_LM4F120H5QR

void
NRF24L01_Init(	unsigned long ulCEBase,
				unsigned long ulCEPin,
				unsigned long ulCEPeriph,
				unsigned long ulCSNBase,
				unsigned long ulCSNPin,
				unsigned long ulCSNPeriph,
				unsigned char ucSSIIndex)
{
	//g_ucPdlibStatus = 0x00;
	/* PS: Initialize communication */
#ifdef PDLIB_SPI
	pdlibSPI_ConfigureSPIInterface(ucSSIIndex);
#endif

	/* PS: Set the CE pin */
	g_ulCEBase = ulCEBase;
	g_ulCEPin = ulCEPin;
	
	/* PS: Set the CSN pin */
	g_ulCSNBase = ulCSNBase;
	g_ulCSNPin = ulCSNPin;

	/* PS: Configure the CE pin to be GPIO output */
	ROM_SysCtlPeripheralEnable(ulCEPeriph);
	ROM_GPIOPinTypeGPIOOutput(g_ulCEBase, g_ulCEPin);
	
	_NRF24L01_CELow();

	/* PS: Configure the CSN pin to be GPIO output */
	ROM_SysCtlPeripheralEnable(ulCSNPeriph);
	ROM_GPIOPinTypeGPIOOutput(ulCSNBase, ulCSNPin);

	_NRF24L01_CSNHigh();

