pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
	// PS: Check the Auto Ack feature and make sure the data pipe 0 has the correct PTX address
	cTemp = NRF24L01_RegisterRead_8(RF24_EN_AA);

	if(cTemp & RF24_ENAA_P0){
		NRF24L01_RegisterRead_Multi(RF24_TX_ADDR, address, 5);
		NRF24L01_SetRxAddress(PDLIB_NRF24_PIPE0, address);
	}

	ret = NRF24L01_SetTxPayload(pcData, uiLength);

	return ret;
}

/* PS:
 *
 * Function		: 	NRF24L01_SendDataTo
 *
 * Arguments	: 	pcData		:	Data packet to send
 * 					ulLength	:	Length of the packet
 * 					pcTxAddr	:	TX address
 *
 * Return		:	PDLIB_NRF24_SUCCESS			: Success
 * 					PDLIB_NRF24_TX_FIFO_FULL 	: Tx FIFO full
 *					PDLIB_NRF24_TX_ARC_REACHED	: Maximum retransmissions elapsed
 *
 * Description	: 	The function will send the specified data using
 * 					current configuration but to the specified address. (current air data rate,
 * 					current power, ... )
 *
 * 					The function will return after the data is successfully transmitted or
 * 					maximum retransmissions were done.
 *
 * 					This function will change the TX address in the module.
 *
 */

int NRF24L01_SendDataTo(unsigned char *address, char *pcData, unsigned int uiLength)
{
	int iRet;

	NRF24L01_SetTXAddress(address);

	iRet = NRF24L01_SendData(pcData, uiLength);

	return iRet;
}





// ----------------------- Register Read/Write functions ---------------------- //


/* PS:
 * 
 * Function		: 	NRF24L01_RegisterWrite_8
 * 
 * Arguments	: 	ucRegister	:	Address of the register
 * 					ucValue		:	Value to write to the register
 * 
 * Return		: 	None
 * 
 * Description	: 	This function will write 1 byte of data to an 8 bit
 * 					register. The function will update the Status
 * 					variable too.
 * 
 */
 
void
NRF24L01_RegisterWrite_8(unsigned char ucRegister, unsigned char ucValue)
{
	unsigned char ucData[2];
	
	ucData[0] = (RF24_W_REGISTER | ucRegister);
	ucData[1] = ucValue;
	
	_NRF24L01_CSNLow();
	
#ifdef PDLIB_SPI
	/* PS: Send address */
	g_ucStatus = pdlibSPI_TransferByte(ucData[0]);

	/* PS: Send data */
	pdlibSPI_TransferByte(ucData[1]);
#endif

	_NRF24L01_CSNHigh();
}


/* PS:
 * 
 * Function		: 	NRF24L01_RegisterWrite_Multi
 * 
 * Arguments	: 	ucRegister	:	Address of the register
 * 					pucData		:	Value to write to the register
 * 					uiLength	:	Length of the data field
 * 
 * Return		: 	None
 * 
 * Description	: 	This function will write more than one byte of data 
 * 					to an the specified register. 
 * 					Function will update the Status	variable too.
 * 
 */
 
void
NRF24L01_RegisterWrite_Multi(	unsigned char ucRegister,
								unsigned char *pucData,
								unsigned int uiLength)
{
	if(NULL != pucData)
	{
		unsigned char *pucBuffer = (unsigned char*) malloc(sizeof(unsigned char) * (uiLength));
		
		if(NULL != pucBuffer)
		{
			memcpy(pucBuffer, pucData, uiLength);

			_NRF24L01_CSNLow();

#ifdef PDLIB_SPI
			g_ucStatus = pdlibSPI_TransferByte(RF24_W_REGISTER | ucRegister);
			pdlibSPI_SendData(pucBuffer, uiLength);
#endif
			_NRF24L01_CSNHigh();

			free(pucBuffer);
		}
	}
}


/* PS:
 * 
 * Function		: 	NRF24L01_RegisterRead_8
 * 
 * Arguments	: 	ucRegister	:	Address of the register
 * 
 * Return		: 	The value in the 8 bit register
 * 
 * Description	: 	This function will write 1 byte of data to an 8 bit
 * 					register. The function will update the Status
 * 					variable too.
 * 
 */
 
unsigned char
NRF24L01_RegisterRead_8(unsigned char ucRegister)
{
	unsigned char ucData;

	_NRF24L01_CSNLow();

#ifdef PDLIB_SPI
	g_ucStatus = pdlibSPI_TransferByte(RF24_R_REGISTER | ucRegister);
	
	ucData = pdlibSPI_TransferByte(RF24_NOP);
#endif

	_NRF24L01_CSNHigh();

	return ucData;
}


/* PS:
 *
 * Function		: 	NRF24L01_RegisterRead_Multi
 *
 * Arguments	: 	ucRegister	:	Address of the register
 * 					pucBuffer	: 	Buffer to store the reply
 * 					uiLength	:	Length of the buffer
 *
 * Return		: 	Status register value will be returned.
 *
 * Description	: 	This function will read more than 1 byte of data from a
 * 					register. The function will update the Status
 * 					variable too.
 *
 */

unsigned char
NRF24L01_RegisterRead_Multi(	unsigned char ucRegister,
								unsigned char *pucBuffer,
								unsigned int uiLength)
{
	int i;

	_NRF24L01_CSNLow();

#ifdef PDLIB_SPI
	g_ucStatus = pdlibSPI_TransferByte(RF24_R_REGISTER | ucRegister);

	for(i = 0; i<uiLength; i++)
	{
		pucBuffer[i] = pdlibSPI_TransferByte(RF24_NOP);
	}
#endif

	_NRF24L01_CSNHigh();

	return g_ucStatus;
}


/* PS:
 *
 * Function		: 	NRF24L01_SendCommand
 *
 * Arguments	: 	ucCommand	:	Command to send.
 * 					pucData		:	Data associated with the command
 * 					uiLength	:	Length of the data field
 *
 * Return		: 	None
 *
 * Description	: 	This function will send any command with the data buffer
 * 					to the RF module. This will also update the status register.
 * 					If there is no payload for the command set the pucData NULL and
 * 					make the uiLength as 0
 *
 */

void
NRF24L01_SendCommand(	unsigned char ucCommand,
						char *pcData,
						unsigned int uiLength)
{
	unsigned char *pucBuffer = (unsigned char*) malloc(sizeof(unsigned char) * (uiLength + 1));

	if(NULL != pucBuffer)
	{
		pucBuffer[0] = ucCommand;

		if(NULL != pcData)
		{
			memcpy(&pucBuffer[1], pcData, uiLength);
		}

		_NRF24L01_CSNLow();

#ifdef PDLIB_SPI
		pdlibSPI_SendData(pucBuffer, uiLength+1);
#endif

		_NRF24L01_CSNHigh();

		free(pucBuffer);
	}
}


/* PS:
 *
 * Function		: 	NRF24L01_SendRcvCommand
 *
 * Arguments	: 	ucCommand	:	Command to send.
 * 					pucData		:	Buffer to get data
 * 					uiLength	:	Length of the buffer
 *
 * Return		: 	None
 *
 * Description	: 	This function will send any command with the data buffer
 * 					to the RF module. After that it will read the specifed
 * 					amount of data and store it as the reply in the provided
 * 					buffer.
 *
 */

void NRF24L01_SendRcvCommand(unsigned char ucCommand, char *pcData, unsigned int uiLength)
{
	if(pcData){
		int i = 0;

		_NRF24L01_CSNLow();

#ifdef PDLIB_SPI
		g_ucStatus = pdlibSPI_TransferByte(ucCommand);

		for(i = 0; i < uiLength; i++)
		{
			pcData[i] = pdlibSPI_TransferByte(RF24_NOP);
		}
#endif
		_NRF24L01_CSNHigh();
	}
}


// ----------------  Hardware Pin Control ------------------ //


/* PS:
 *
 * Function		: 	_NRF24L01_CELow
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CE pin low
 *
 */

static void
_NRF24L01_CELow()
{
#ifdef PART_LM4F120H5QR
	ROM_GPIOPinWrite(g_ulCEBase, g_ulCEPin, 0x00);
#endif
}


/* PS:
 *
 * Function		: 	_NRF24L01_CEHigh
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CE pin high
 *
 */

static void
_NRF24L01_CEHigh()
{
#ifdef PART_LM4F120H5QR
	ROM_GPIOPinWrite(g_ulCEBase, g_ulCEPin, 0xFF);
#endif
}


/* PS:
 *
 * Function		: 	_NRF24L01_CSNLow
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CSN pin low
 *
 */

static void
_NRF24L01_CSNLow()
{
#ifdef PART_LM4F120H5QR
	ROM_GPIOPinWrite(g_ulCSNBase, g_ulCSNPin, 0x00);
#endif
}


/* PS:
 *
 * Function		: 	_NRF24L01_CSNHigh
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	This function drives the CSN pin high
 *
 */

static void
_NRF24L01_CSNHigh()
{
#ifdef PART_LM4F120H5QR
	ROM_GPIOPinWrite(g_ulCSNBase, g_ulCSNPin, 0xFF);
#endif
}


